# set up brew cask
tap "caskroom/cask"
tap "caskroom/fonts"
tap "caskroom/drivers"

# brew installs
brew "zsh"
brew "zsh-completions"
brew "git"
brew "mas"
brew "sqlite"
brew "wget"
brew "heroku"
brew "python"
brew "node"
brew "yarn"
brew "task"
brew "bdw-gc"
brew "gmp"
brew "libevent"
brew "libxml2"
brew "libyaml"
brew "tig"
brew "awscli"

# brew cask install dev-tools
cask "iterm2"
cask "dash"
cask "postman"
cask "sourcetree"
cask "visual-studio-code"
cask "sequel-pro"
cask "virtualbox"
cask "docker"
cask "github"
cask "gitup"
cask "alfred"
cask "spectacle"

# brew cask install apps
cask "tunnelbear"
cask "spotify"
cask "notion"
cask "typora"
cask "yakyak"
cask "slack"
cask "boom-3d"

# brew cask install browsers
cask "google-chrome"

# brew cask install drivers
# cask "logitech-options"

# brew cask install fonts
cask "font-fira-code"

# Mac Appstore
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "KakaoTalk", id: 869223134
mas "Snappy", id: 512617038
mas "Feedly", id: 396069556
